app/Controllers/ConsultaController.php

    public function guardar()
    {
        $data = [
            'nombre' => $this->request->getPost('nombre'),
            'email' => $this->request->getPost('email'),
            'mensaje' => $this->request->getPost('mensaje'),
            'fecha' => date('Y-m-d H:i:s')
        ];

        $this->consultaModel->insert($data);
---
INSERT INTO `consultas` (`nombre`, `email`, `mensaje`, `fecha`) VALUES ('asdasdas', 'mmmauricio37@gmail.com', 'asdasd', '2025-07-05 01:46:25')